ticketTrain/soap-app/src/test/resources/requests/ticket/getSearchTicketByDateAndDirectionRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:xs="http://epam.com/brest2019/courses/soap/model/ticket">

    <soapenv:Header/>
    <soapenv:Body>
        <xs:getSearchTicketByDateAndDirectionRequest>
            <xs:startDate>2019-09-22</xs:startDate>
            <xs:finishDate>2019-09-27</xs:finishDate>
            <xs:directionFrom>1</xs:directionFrom>
            <xs:directionTo>6</xs:directionTo>
        </xs:getSearchTicketByDateAndDirectionRequest>
    </soapenv:Body>

</soapenv:Envelope>